package com.example.recognizethesong;

public class QuizModel {

    public int songs[] = {R.raw.edenhasonshkiotadumot, R.raw.resisimravivcaner, R.raw.ahavahola,
            R.raw.noetsetmabat, R.raw.imatholechet, R.raw.kimatshirahava, R.raw.ahavaktana,
            R.raw.altishali, R.raw.derechhashalom, R.raw.rikudromanti};
    public String[][] answers = {{"פשוטים", "שקיעות אדומות", "ילדים כאלה", "לאהוב אותך כל יום"},
            {"רסיסים", "רוצה שלום", "מתוק כשמרלי", "הגורל הזה"},
            {"חרבו דרבו", "ואיך שלא", "אחרי הנצח", "אהבה חולה"},
            {"נועצת מבט", "אז הלכתי", "רחוק מכולם", "שדות של תירוצים"},
            {"בחור חדש", "אם את הולכת", "ילדה קטנה", "סימני הזמן"},
            {"שירי דיכאון", "אף אחת אחרת", "כמעט שיר אהבה", "אחרי הכל מגעגע"},
            {"שמישהו יעצור אותי", "לפעמים", "צבעים", "אהבה קטנה"},
            {"חלק מהזמן", "ואם תבואי אליי", "צבעים", "אל תשאלי"},
            {"משקה יקר", "היי מאמא", "דרך השלום", "דפיקות הלב"},
            {"סרט הודי", "ריקוד רומנטי", "בניתי עלייך", "מהפכה של שמחה"}};
    public String[] correctAnswers = {"שקיעות אדומות", "רסיסים", "אהבה חולה", "נועצת מבט", "אם את הולכת", "כמעט שיר אהבה", "אהבה קטנה",
            "אל תשאלי", "דרך השלום", "ריקוד רומנטי"};

}
